;;;; part_6.lisp

(in-package #:idelchik)

(defparameter part_6_doc
  "Сопротивление при течении с изменением направления потока 
  (коэффициенты сопротивления изогнутых участков колен, отводов и др.)")

(defparameter Idl-6-1-1-A1-data
  '((0.000 0.0)
    (20.00 0.31)
    (30.00 0.45)   
    (45.00 0.60)
    (60.00 0.78)
    (75.00 0.90)
    (90.00 1.00)
    (110.0 1.13)
    (130.0 1.20)
    (150.0 1.28)
    (180.0 1.40)))

(defparameter Idl-6-1-1-B1-data
  '((0.444 1.18)
    (0.5 1.18)
    (0.6 0.77)
    (0.7 0.51)
    (0.8 0.37)
    (0.9 0.28)
    (1.0 0.21)
    (1.25 0.19)
    (1.50 0.17)
    (2.0 0.15)
    (4.0 0.11)
    (6.0 0.09)
    (8.0 0.07)
    (10 0.07)
    (20 0.05)
    (30 0.04)
    (40 0.03)
    (55.55 0.03)))

(defun Idl-6-1-A1 (x)
  (table_aproximate x Idl-6-1-1-A1-data))

(defun Idl-6-1-1-B1 (x)
  (table_aproximate x Idl-6-1-1-B1-data)))

(defun Idl-6-1-1-C1 () 1.0)

(defun Idl-6-1-1-dzeta_mu(delta_gradus R0_D0 a0_b0)
  (*
    (Idl-6-1-1-A1 delta_gradus)
    (Idl-6-1-1-B1 R0_D0)
    (Idl-6-1-1-C1 a0_b0)))

(defun Idl-6-1-1-dzeta (delta_gradus R0 D0 mikro_hight)
  "Поворот 
delta_gradus - угол поворота в градусах 
R0[m] - средний радиус отвода (ugolnik)
D0[m] - диаметр отвода"
  (+ (Idl-6-1-1-dzeta_mu delta_gradus (/ R0 D0) (/ a0 b0))
     (*	0.0175 delta_gradus
	(Idl-2-6-lambda (/ mikro_hight D0))
	(/ R0 D0))))

(defun Idl-6-1-1-dzeta____ (delta_gradus R0 D0 mikro_hight)
  "Поворот 
delta_gradus - угол поворота в градусах 
R0[m] - средний радиус отвода (ugolnik)
D0[m] - диаметр отвода"
  (+ (Idl-6-1-1-dzeta_mu delta_gradus (/ R0 D0) (/ a0 b0))
     (*	0.0175 delta_gradus
	(Idl-2-6-lambda (/ mikro_hight D0))
	(/ R0 D0))))

(defun Idl-6-1-2-k-Δ (R0 D0 Re _d)
  (values
   (cond
     ((and
       (<= (/ R0 D0) 0.55)
       (<= 3.0e3 Re) (<= Re 4.0e4)) 1.0)
     ((and
       (<= (/ R0 D0) 0.55)
       (< 4.0e4 Re))
      (cond
	((= _d 0.0) 1.0)
	((<= _d 0.001) (+ 1.0 (* 0.5e3 _d)))
	((< 0.001 _d) 1.5)))
     ((and
       (< 0.55 (/ R0 D0))
       (<= 3.0e3 Re) (<= Re 4.0e4))
      (cond
	((= _d 0.0) 1.0)
	((<= _d 0.001) 1.0)
	((< 0.001 _d) 1.0)))
     ((and
       (< 0.55 (/ R0 D0))
       (< 4.0e4 Re) (<= Re 2.0e5))
      (cond
	((= _d 0.0) 1.0)
	((<= _d 0.001) (/ (Idl-2-2-λ_ravnomer Re _d) (Idl-2-1-λ_gl Re)))
	((< 0.001 _d) 2.0)))
     ((and
       (< 0.55 (/ R0 D0))
       (< 2.0e5 Re))
      (cond
	((= _d 0.0) 1.0)
	((<= _d 0.001) (+ 1.0 (* 1.0e3 _d)))
	((< 0.001 _d) 2.0))))
   (format nil "R0=~A D0=~A Re=~A _d=~A" R0 D0 Re _d)))

(Idl-6-1-2-k-Δ 0.025 0.050 3500. 0.0)
(Idl-6-1-2-k-Δ 0.025 0.050 3500. 0.0005)
(Idl-6-1-2-k-Δ 0.025 0.050 3500. 0.0015)

(Idl-6-1-2-k-Δ 0.025 0.050 50000. 0.0)
(Idl-6-1-2-k-Δ 0.025 0.050 50000. 0.0005)
(Idl-6-1-2-k-Δ 0.025 0.050 50000. 0.0015)

(Idl-6-1-2-k-Δ 0.050 0.050 35000. 0.000)
(Idl-6-1-2-k-Δ 0.050 0.050 35000. 0.0005)
(Idl-6-1-2-k-Δ 0.050 0.050 35000. 0.0015)

(Idl-6-1-2-k-Δ 0.050 0.050 50000. 0.000)
(Idl-6-1-2-k-Δ 0.050 0.050 50000. 0.00075)
(Idl-6-1-2-k-Δ 0.050 0.050 50000. 0.0015)

(Idl-6-1-2-k-Δ 0.050 0.050 5.0e5 0.000)
(Idl-6-1-2-k-Δ 0.050 0.050 5.0e5 0.0005)
(Idl-6-1-2-k-Δ 0.050 0.050 5.0e5 0.0015)



